// Bengali Layout (InScript)
MultiLanguageKeyboard.registerLayout('bengali', {
    name: '🇧🇩 বাংলা',
    normal: [
        ['ৎ', '১', '২', '৩', '৪', '৫', '৬', '৭', '৮', '৯', '০', '-', 'ৃ', 'Backspace'],
        ['Tab', 'ৌ', 'ৈ', 'া', 'ী', 'ূ', 'ব', 'হ', 'গ', 'দ', 'জ', 'ড', '়', 'ৗ'],
        ['Caps', 'ো', 'ে', '্', 'ি', 'ু', 'প', 'র', 'ক', 'ত', 'চ', 'ট', 'Enter'],
        ['Shift', 'এ', 'ং', 'ম', 'ন', 'ব', 'ল', 'স', ',', '.', 'য', 'Shift'],
        ['Ctrl', 'Win', 'Alt', 'Space', 'Alt', 'Win', 'Menu', 'Ctrl']
    ],
    shift: [
        ['অ', 'ৠ', 'ৡ', 'র্', 'জ্ঞ', 'ত্র', 'ক্ষ', 'শ্র', '(', ')', 'ঃ', 'ঋ', 'Backspace'],
        ['Tab', 'ঔ', 'ঐ', 'আ', 'ঈ', 'ঊ', 'ভ', 'ঙ', 'ঘ', 'ধ', 'ঝ', 'ঢ', 'ঞ', 'ৗ'],
        ['Caps', 'ও', 'এ', 'অ', 'ই', 'উ', 'ফ', 'ড়', 'খ', 'থ', 'ছ', 'ঠ', 'Enter'],
        ['Shift', 'এ', 'ঁ', 'ম', 'ণ', 'ব', 'ল', 'শ', 'ষ', '।', 'য', 'Shift'],
        ['Ctrl', 'Win', 'Alt', 'Space', 'Alt', 'Win', 'Menu', 'Ctrl']
    ]
});
