// Gujarati Layout (InScript)
MultiLanguageKeyboard.registerLayout('gujarati', {
    name: '🇮🇳 ગુજરાતી',
    normal: [
        ['ૈ', '૧', '૨', '૩', '૪', '૫', '૬', '૭', '૮', '૯', '૦', '-', 'ૃ', 'Backspace'],
        ['Tab', 'ૌ', 'ૈ', 'ા', 'ી', 'ૂ', 'બ', 'હ', 'ગ', 'દ', 'જ', 'ડ', '઼', 'ૉ'],
        ['Caps', 'ો', 'ે', '્', 'િ', 'ુ', 'પ', 'ર', 'ક', 'ત', 'ચ', 'ટ', 'Enter'],
        ['Shift', 'ૅ', 'ં', 'મ', 'ન', 'વ', 'લ', 'સ', ',', '.', 'ય', 'Shift'],
        ['Ctrl', 'Win', 'Alt', 'Space', 'Alt', 'Win', 'Menu', 'Ctrl']
    ],
    shift: [
        ['ઑ', 'ઍ', 'ૅ', '્ર', 'ર્દ', 'ટ્ઠ', 'ણ', 'ઘ', 'ઙ', 'ઝ', '઼', 'ઃ', '઼', 'Backspace'],
        ['Tab', 'ઔ', 'ઐ', 'આ', 'ઈ', 'ઊ', 'ભ', 'ઃ', 'ગ', 'ધ', 'ઝ', 'ઢ', 'ઞ', 'ઑ'],
        ['Caps', 'ઓ', 'એ', 'અ', 'ઇ', 'ઉ', 'ફ', '઱', 'ખ', 'થ', 'છ', 'ઠ', 'Enter'],
        ['Shift', 'ઍ', 'ઁ', 'મ', 'ન', 'વ', 'લ', 'શ', 'ષ', '।', 'ય', 'Shift'],
        ['Ctrl', 'Win', 'Alt', 'Space', 'Alt', 'Win', 'Menu', 'Ctrl']
    ]
});
