// Hindi Devanagari Layout (InScript)
MultiLanguageKeyboard.registerLayout('hindi', {
    name: '🇮🇳 हिन्दी',
    normal: [
        ['ॊ', '१', '२', '३', '४', '५', '६', '७', '८', '९', '०', '-', 'ृ', 'Backspace'],
        ['Tab', 'ौ', 'ै', 'ा', 'ी', 'ू', 'ब', 'ह', 'ग', 'द', 'ज', 'ड', '़', 'ॉ'],
        ['Caps', 'ो', 'े', '्', 'ि', 'ु', 'प', 'र', 'क', 'त', 'च', 'ट', 'Enter'],
        ['Shift', 'ॆ', 'ं', 'म', 'न', 'व', 'ल', 'स', ',', '.', 'य', 'Shift'],
        ['Ctrl', 'Win', 'Alt', 'Space', 'Alt', 'Win', 'Menu', 'Ctrl']
    ],
    shift: [
        ['ऒ', 'ऍ', 'ॅ', '्र', 'र्द', 'ट्ठ', 'ण', 'घ', 'ङ', 'झ', '़', 'ः', '़', 'Backspace'],
        ['Tab', 'औ', 'ऐ', 'आ', 'ई', 'ऊ', 'भ', 'ः', 'ग', 'ध', 'झ', 'ढ', 'ञ', 'ऑ'],
        ['Caps', 'ओ', 'ए', 'अ', 'इ', 'उ', 'फ', 'ऱ', 'ख', 'थ', 'छ', 'ठ', 'Enter'],
        ['Shift', 'ऎ', 'ँ', 'म', 'न', 'व', 'ल', 'श', 'ष', '।', 'य', 'Shift'],
        ['Ctrl', 'Win', 'Alt', 'Space', 'Alt', 'Win', 'Menu', 'Ctrl']
    ]
});
