// Punjabi Gurmukhi Layout (InScript)
MultiLanguageKeyboard.registerLayout('punjabi', {
    name: '🇮🇳 ਪੰਜਾਬੀ',
    normal: [
        ['ੌ', '੧', '੨', '੩', '੪', '੫', '੬', '੭', '੮', '੯', '੦', '-', 'ੁ', 'Backspace'],
        ['Tab', 'ੌ', 'ੈ', 'ਾ', 'ੀ', 'ੂ', 'ਬ', 'ਹ', 'ਗ', 'ਦ', 'ਜ', 'ਡ', '਼', 'ੋ'],
        ['Caps', 'ੋ', 'ੇ', '੍', 'ਿ', 'ੁ', 'ਪ', 'ਰ', 'ਕ', 'ਤ', 'ਚ', 'ਟ', 'Enter'],
        ['Shift', 'ੲ', 'ਂ', 'ਮ', 'ਨ', 'ਵ', 'ਲ', 'ਸ', ',', '.', 'ਯ', 'Shift'],
        ['Ctrl', 'Win', 'Alt', 'Space', 'Alt', 'Win', 'Menu', 'Ctrl']
    ],
    shift: [
        ['ਓ', 'ਐ', 'ਔ', '੍ਰ', 'ਣ', 'ਘ', 'ਙ', 'ਝ', '਼', 'ਃ', '਼', 'ੱ', 'Backspace'],
        ['Tab', 'ਔ', 'ਐ', 'ਆ', 'ਈ', 'ਊ', 'ਭ', 'ਃ', 'ਗ', 'ਧ', 'ਝ', 'ਢ', 'ਞ', 'ਓ'],
        ['Caps', 'ਓ', 'ਏ', 'ਅ', 'ਇ', 'ਉ', 'ਫ', 'ੜ', 'ਖ', 'ਥ', 'ਛ', 'ਠ', 'Enter'],
        ['Shift', 'ਏ', 'ਁ', 'ਮ', 'ਨ', 'ਵ', 'ਲ', 'ਸ਼', 'ਸ਼', '।', 'ਯ', 'Shift'],
        ['Ctrl', 'Win', 'Alt', 'Space', 'Alt', 'Win', 'Menu', 'Ctrl']
    ]
});
