// Tamil 99 Layout
MultiLanguageKeyboard.registerLayout('tamil', {
    name: '🇮🇳 தமிழ்',
    normal: [
        ['ொ', '௧', '௨', '௩', '௪', '௫', '௬', '௭', '௮', '௯', '௦', '-', '்', 'Backspace'],
        ['Tab', 'ௌ', 'ை', 'ா', 'ீ', 'ூ', 'ப', 'ஹ', 'க', 'த', 'ஜ', 'ட', 'ஞ', 'Backspace'],
        ['Caps', 'ோ', 'ே', '்', 'ி', 'ு', 'ப', 'ர', 'க', 'த', 'ச', 'ட', 'Enter'],
        ['Shift', 'ெ', 'ஂ', 'ம', 'ந', 'வ', 'ல', 'ச', ',', '.', 'ய', 'Shift'],
        ['Ctrl', 'Win', 'Alt', 'Space', 'Alt', 'Win', 'Menu', 'Ctrl']
    ],
    shift: [
        ['ஒ', 'எ', 'ஏ', 'ற்', 'க்ஷ', 'ஸ்', 'ஷ்', 'ஸ்ரீ', '(', ')', ':', 'ஃ', 'Backspace'],
        ['Tab', 'ஔ', 'ஐ', 'ஆ', 'ஈ', 'ஊ', 'ப', 'ஹ', 'க', 'த', 'ஜ', 'ட', 'ஞ', 'Backspace'],
        ['Caps', 'ஓ', 'ஏ', 'அ', 'இ', 'உ', 'ப', 'ற', 'க', 'த', 'ச', 'ட', 'Enter'],
        ['Shift', 'எ', 'ஂ', 'ம', 'ன', 'வ', 'ள', 'ஸ', 'ஷ', '।', 'ய', 'Shift'],
        ['Ctrl', 'Win', 'Alt', 'Space', 'Alt', 'Win', 'Menu', 'Ctrl']
    ]
});
