// Telugu Layout
MultiLanguageKeyboard.registerLayout('telugu', {
    name: '🇮🇳 తెలుగు',
    normal: [
        ['ొ', '౧', '౨', '౩', '౪', '౫', '౬', '౭', '౮', '౯', '౦', '-', 'ృ', 'Backspace'],
        ['Tab', 'ౌ', 'ై', 'ా', 'ీ', 'ూ', 'బ', 'హ', 'గ', 'ద', 'జ', 'డ', 'ఞ', 'Backspace'],
        ['Caps', 'ో', 'ే', '్', 'ి', 'ు', 'ప', 'ర', 'క', 'త', 'చ', 'ట', 'Enter'],
        ['Shift', 'ె', 'ం', 'మ', 'న', 'వ', 'ల', 'స', ',', '.', 'య', 'Shift'],
        ['Ctrl', 'Win', 'Alt', 'Space', 'Alt', 'Win', 'Menu', 'Ctrl']
    ],
    shift: [
        ['ఒ', 'ఎ', 'ఏ', 'ర్', 'జ్ఞ', 'త్ర', 'క్ష', 'శ్ర', '(', ')', 'ః', 'ఋ', 'Backspace'],
        ['Tab', 'ఔ', 'ఐ', 'ఆ', 'ఈ', 'ఊ', 'భ', 'ఙ', 'ఘ', 'ధ', 'ఝ', 'ఢ', 'ఞ', 'Backspace'],
        ['Caps', 'ఓ', 'ఏ', 'అ', 'ఇ', 'ఉ', 'ఫ', 'ఱ', 'ఖ', 'థ', 'ఛ', 'ఠ', 'Enter'],
        ['Shift', 'ఎ', 'ఁ', 'మ', 'న', 'వ', 'ళ', 'శ', 'ష', '।', 'య', 'Shift'],
        ['Ctrl', 'Win', 'Alt', 'Space', 'Alt', 'Win', 'Menu', 'Ctrl']
    ]
});
